Spring/Spring-CXF/src/test/resources/sample/SOAPRequest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><wsu:Timestamp wsu:Id="TS-0e50029d-b62b-4026-b02a-e59115cf10a7"><wsu:Created>2015-12-15T13:24:22.049Z</wsu:Created><wsu:Expires>2015-12-15T13:29:22.049Z</wsu:Expires></wsu:Timestamp><wsse:UsernameToken wsu:Id="UsernameToken-55f22775-9a66-492e-9837-5e9e6b2903dc"><wsse:Username>alice</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">acgu7oJnSxt366nySdGIrWvpLYc=</wsse:Password><wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">HhN6SUU0jSeZVdP7KMd6zA==</wsse:Nonce><wsu:Created>2015-12-15T13:24:22.002Z</wsu:Created></wsse:UsernameToken></wsse:Security></SOAP-ENV:Header><soap:Body><ns2:getStudent xmlns:ns2="http://service.ws.sample.com/"><arg0><id>416436</id></arg0></ns2:getStudent></soap:Body></soap:Envelope>